# 시리즈 만들기

In [3]:
import pandas as pd

sd1 = pd.Series(['Dog','Cat','Tiger','Lion','Monkey'],index = ['강아지','고양이','호랑이','사자','원숭이'])

print(sd1)

강아지       Dog
고양이       Cat
호랑이     Tiger
사자       Lion
원숭이    Monkey
dtype: object

# 딕셔너리 만들기

In [6]:
import pandas as pd

dict_data = {'a':1,'b':2,'c':3}
sd2 = pd.Series(dict_data)

print(type(sd2))

print(sd2)

<class 'pandas.core.series.Series'>
a    1
b    2
c    3
dtype: int64

# 딕셔너리 만들기 2

In [7]:
import pandas as pd

dict_data = {'동물':['Dog','Cat','Tiger','Lion','Monkey'],'나이':[7,9,2,3,1]}
df1 = pd.DataFrame(dict_data)

type(df1)

# print(df1) 인덱스가 동물이 아닌 숫자로 나옴
print(df1.set_index('동물'))

        나이
동물
Dog      7
Cat      9
Tiger    2
Lion     3
Monkey   1

In [9]:
# 연습

dict_data = {'동물':['인간','원숭이','사자','호랑이','강아지'],'나이':['3','4','5','6','7'],'성별':['남','여','여','남','여']}

df1 = pd.DataFrame(dict_data)

print(type(df1))

print(df1)

<class 'pandas.core.frame.DataFrame'>
    동물 나이 성별
0   인간  3  남
1  원숭이  4  여
2   사자  5  여
3  호랑이  6  남
4  강아지  7  여

# 리스트 만들기

In [8]:
import pandas as pd

list_data = pd.Series(['Dog','Cat','Tiger','Lion','Monkey'],index=['강아지','고양이','호랑이','사자','원숭이'])

sd3 = pd.Series(list_data)

sd3

강아지       Dog
고양이       Cat
호랑이     Tiger
사자       Lion
원숭이    Monkey
dtype: object

In [8]:
import pandas as pd

df2 = pd.DataFrame([['Dog','7'],['Cat','9'],['Tiger','2'],['Lion','3'],['Monkey','1']],
                  index = ['0','1','2','3','4'],columns=['동물','나이'])

print(df2)

       동물 나이
0     Dog  7
1     Cat  9
2   Tiger  2
3    Lion  3
4  Monkey  1

# 튜플 만들기

In [9]:
import pandas as pd

tup_data = ('이순신','1991-03-15','남')

sd4 = pd.Series(tup_data,index=['이름','생년월일','성별'])

sd4

이름             이순신
생년월일    1991-03-15
성별               남
dtype: object

# 변수 유형별 데이터 분석

In [1]:
# 범주형 빈도 분석 df.value_counts()
# 범주형 교차 분석 df.crosstab()

# 라이브러리
import pandas as pd
import seaborn as sns

# 데이터 준비
tips = sns.load_dataset('tips') #팁 데이터

# 데이터 확인
tips

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [2]:
# 데이터 유형 확인
# tips. 데이터의 범주형 변수는 sex ,smoker,day,time 4개

tips.dtypes # category

total_bill     float64
tip            float64
sex           category
smoker        category
day           category
time          category
size             int64
dtype: object

In [3]:
# 범주형 빈도 분석
# 성별
tips.sex.value_counts()

Male      157
Female     87
Name: sex, dtype: int64

In [4]:
# 범주형 빈도 분석
# 요일별
tips.day.value_counts()

Sat     87
Sun     76
Thur    62
Fri     19
Name: day, dtype: int64

In [7]:
# 교차분석
# 성별 , 요일
pd.crosstab(tips.sex,tips.day) 

# pd.crosstab(tips['sex'],tips['day'])

day     Thur  Fri  Sat  Sun
sex
Male      30   10   59   58
Female    32    9   28   18

In [11]:
# 여백 또는 누적 값 cumulatives
pd.crosstab(tips.sex,tips.day,margins=True) # 전체 값에 대해서 알수있다

day     Thur  Fri  Sat  Sun  All
sex
Male      30   10   59   58  157
Female    32    9   28   18   87
All       62   19   87   76  244

In [17]:
# 전체 빈도 비율 확인
pd.crosstab(tips.sex,tips.day).apply(lambda r:r/len(tips),axis=1)

day         Thur       Fri       Sat       Sun
sex
Male    0.122951  0.040984  0.241803  0.237705
Female  0.131148  0.036885  0.114754  0.073770

In [19]:
tips.describe()

       total_bill         tip        size
count  244.000000  244.000000  244.000000
mean    19.785943    2.998279    2.569672
std      8.902412    1.383638    0.951100
min      3.070000    1.000000    1.000000
25%     13.347500    2.000000    2.000000
50%     17.795000    2.900000    2.000000
75%     24.127500    3.562500    3.000000
max     50.810000   10.000000    6.000000